index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>index</title>
<!-- 2019-01-12 Sat 15:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">index</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Matthew Blount</h2>
<div class="outline-text-2" id="text-1">
<p>
I'm a software developer in Brooklyn, New York. I'm working on a
project called <a href="https://github.com/xkapastel/denshi">Denshi</a>, a development environment that incorporates
modern research in programming languages and machine learning.
</p>

<p>
<a href="https://twitter.com/xkapastel">Twitter</a> - <a href="https://github.com/xkapastel">GitHub</a> - <a href="https://liberapay.com/xkapastel">Liberapay</a>
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Writing</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="./essays/dialect.html">Dialects in Denshi</a>
</li>
</ul>
<p>
Mutually intelligible domain specific languages: they share a common
denotational (computability) semantics, but differ in their
operational (complexity) semantics.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Reading</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Some interesting things I've read, sometimes with notes.
</p>

<ul class="org-ul">
<li><a href="https://arxiv.org/abs/1801.03526">Neural Program Synthesis with Priority Queue Training</a>
</li>
</ul>

<p>
An interesting result in neural program synthesis: it's feasible to
"bootstrap" a random neural network in to solving simple problems by
training it with its own output. <a href="./notes/pqt.html">(Notes)</a>
</p>

<ul class="org-ul">
<li><a href="https://dl.acm.org/citation.cfm?id=3205597&dl=ACM&coll=DL">Learning an evolvable genotype-phenotype mapping</a>
</li>
</ul>

<p>
Using autoencoders to learn genotypes. <a href="./notes/automap.html">(Notes)</a>
</p>

<ul class="org-ul">
<li><a href="http://www.jmlr.org/papers/volume18/15-631/15-631.pdf">Hinge-Loss Markov Random Fields and Probabilistic Soft Logic</a>
  <a href="http://stephenbach.net/files/kimmig-probprog12.pdf">A Short Introduction to Probabilistic Soft Logic</a>
</li>
</ul>

<p>
A way to merge logical and statistical techniques for machine
learning. Looks a lot like a cleaned up and continuous version of the
Tsetlin machine. <a href="./notes/psl.html">(Notes)</a>
</p>

<ul class="org-ul">
<li><a href="https://arxiv.org/abs/1804.01508">The Tsetlin Machine - A Game Theoretic Bandit Driven Approach to
Optimal Pattern Recognition with Propositional Logic</a>
</li>
</ul>

<p>
A way to construct a neural net-like device with propositional
logic. <a href="./notes/tsetlin.html">(Notes)</a>
</p>

<ul class="org-ul">
<li><a href="https://www.dreamsongs.com/Files/Incommensurability.pdf">The Structure of a Programming Language Revolution</a>
</li>
</ul>

<p>
A look at the competing paradigms of programming languages and
programming systems. <a href="./notes/revolution.html">(Notes)</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
